[
  {
    "version" : "1.1",
    "date" : "26.08.2012",
    "changes" : [
      "All urls are normalized to never have trailing slashes. Fixes unfound urls when user forgets to add trailing slash to permalink formats.",
      "Default partials have been moved to the 'system' level; ruhoh gem. User may still override them at the blog/theme level.",
      "Partial files may now have extensions but wil still be referenced by name excluding extension.",
      "(Internal) All system level assets are namespaced into the 'system' folder.",
      "Theme scaffolding has been removed from the command line tool. `ruhoh theme <name>`"
    ],
    "features" : [
      "@MrWerewolf adds ability to use custom blog scaffold url. Supports mercurial(hg) repository endpoints.",
      "Add IRB console for ruhoh environment: `ruhoh console` ",
      "Add scaffolds for file generation: post, page, layout, etc. System level scaffolds may be overwritten by blog level files."
    ],
    "bugs" : [
      "@MrWerewolf removes psych gem dependency for ruby 1.9+ users."
    ]
  },
  {
    "version" : "1.0",
    "date" : "22.08.2012",
    "changes" : [
      "Ruhoh.setup is now broken out into modular setup routines.",
      "Themes now port over ALL static assets to production when compiling. Change from whitelist to blacklist."
    ],
    "features" : [
      "Add support for base_path which allows all urls to be prepended with a base_path if set.",
      "Support for absolute links to third party domains for javascript and stylesheets within theme.yml",
      "Add urls.theme variable to the payload",
      "Add ?to_json contextual helper"
    ],
    "bugs" : [
      "Themes now correctly port over assets to production when compiling"
    ]
  },
  {
    "version" : "1.0.0.alpha",
    "date" : "05.06.2012",
    "changes" : [
      "Converters now take in (content, id), rather than page object: (page).",
      "Client now has both post and draft generation. Optionally can pass in a title.",
      "Change config format for pages and posts; now must be namespaced respectively.",
      "Major changes to theme directory API",
      "Re-implement how internal config, path, and url parameters are generated and accessed.",
      "Payload object 'paths' is now 'urls' and namespaced with theme_* for consistency",
      "Master and sub layout templating is now handled entirely by mustache.",
      "Add nokogiri as dependency"
    ],
    "features" : [
      "YAML meta-data is now optional",
      "Provide default, global layout attribute for post/page",
      "Add summary and posts_latest helper methods",
      "Add widget system",
      "Add stylesheets asset manager",
      "Add javascripts asset manager",
      "Add RSS compiler",
      "Add ability to run previewer in production mode",
      "Make post filename available to permalink"
    ],
    "bugs" : [
      "Fix permalinks and titlelize methods to support international characters",
      "Transform all extensions registered in a convertable module to .html"
    ]
  },
  {
    "version" : "0.3.0",
    "date" : "13.5.2012",
    "changes" : [
      "Change markdown parser from maruku to redcarpet. Adds support for fenced code blocks and autolinking."
    ],
    "features" : [
      "Add plugin architecture for custom mustache helpers, custom converters, and custom compile tasks."
    ]
  },
  {
    "version" : "0.2.1",
    "date" : "9.5.2012",
    "changes" : [
      "Treat all exclude values for posts/pages filenames as regular expressions. Strings are passed to Regex.new()"
    ],
    "features" : [
      "Define 'pretty' paths for pages without using folder/index.md format.",
      "Add ability to exclude files from posts folder."
    ]
  },
  { "version" : "0.2.0",
    "date" : "4.5.2012",
    "changes" : [
      "[change] Dates in post filenames are now optional but will be required in metadata.",
      "[remove] _draft folder. Drafts are now simply a 'type' of post.",
      "[remove] publish and un-publish in favor of specifying 'type' meta attribute.",
      "[add]    titleize method to client which renames draft filenames to their titles if set.",
      "[change] /_draft panel is now /dash with updated UI.",
      "[change] - rackup configuration is now through Ruhoh::Program.preview."
    ],
    "features" : [
      "Maintain file extensions for files that don't respond to a converter.",
      "Add 'development'/'production' environment configuration flag.",
      "@ben-biddington Introduces local temporary directory as SampleSitePath.",
      "@ben-biddington adds Travis integration."
    ]
  },
  { "version" : "0.1.4",
    "date" : "4.5.2012",
    "bugs" : [
      "Fix invalid byte sequence in US-ASCII by forcing UTF-8"
    ]
  },
  { "version" : "0.1.3",
    "date" : "19.4.2012",
    "bugs" : [
      "Fix drafts not maintaining file extension when publishing",
      "Tags helper should use tags database.",
      "Fix for properly handling filepaths on Windows machines."
    ]
  },
  { "version" : "0.1.2",
    "date" : "18.4.2012",
    "bugs" : [
      "Fix bug with YAML psych/syck errors"
    ]
  },
  { "version" : "0.1.1",
    "date" : "18.4.2012",
    "bugs" : [
      "@tkellen tidies up partials + fix 'paths.theme' error in theme scaffold."
    ]
  },
  { "version" : "0.1.0",
    "date" : "12.4.2012",
    "features" : [
      "Initial public release"
    ]
  }
]  